{
	"basics": {
		"name": "Lara Karki",
		"label": "she/her",
		"picture": "https://notlaura.com/wp-content/uploads/2021/07/lara.png",
		"email": "lara@notlaura.com",
		"linkedin": "linkedin.com/in/notlaura",
		"label": "Human-Centered Computing Ph.D. Research Intern",
		"phone": "(724) 244-2491",
		"summary": "PhD candidate researching AI's impact on work, with proven ability to conduct applied research driving product innovation and adoption in industry settings. Translates complex technical and research concepts into actionable strategic recommendations.",
		"location": "Atlanta, GA",
		"website": "larakarki.com",
		"interests": [
			"Broadening participation in computing",
			"Workforce development and communities of practice"
		],
		"profiles": [
		{
			"network": "Github",
			"url": "https://github.com/laras126"
		},
		{
			"network": "LinkedIn",
			"url": "https://linkedin.com/in/notlaura"
		}]
	},
	"work": [
		{
			"company": "Merck",
			"position": "Intern - Commercial AI Capabilities",
			"startDate": "Summer 2025",
			"endDate": "",
			"summary": "",
			"highlights": [
				"Delivered branded framework for conceptualizing human-centered approaches to AI product development across four domains (adoption, user empowerment, human-AI collaboration, governance), with actionable research agendas prioritized according to business impact; presented to department leadership and socialized across leaders in Animal Health and R&D",
				"Conducted ethnographic observation and interviews with 25+ stakeholders including product designers, data scientists, analysts, leadership, and sales management across business units, identifying adoption bottlenecks as a primary business challenge; translated findings into targeted research protocols and frameworks",
				"Developed and integrated three research protocols into existing product initiatives: interview study assessing AI's impact on sales representative workflows; survey identifying target user segments for proof-of-concept product scaling; and validation survey to assess adoption barriers",
				"Translated academic research on human-AI collaboration for a general audience, presenting to 150+ employees in Responsible AI interest group, facilitating cross-functional knowledge sharing"
			]
		},
		{
			"company": "Georgia Institute of Technology",
			"position": "Research Assistant",
			"startDate": "2022",
			"endDate": "2024",
			"summary": "",
			"highlights": [
				"Conducted applied research on emergent data work roles created by AI/ML technologies, developing integrated training and work-based learning program addressing skill gaps in technology-driven career transitions",
				"Designed and implemented curriculum addressing emergent job search challenges and program gaps, increasing employment outcomes for participants by 50% through targeted skill development interventions",
				"Formed research teams with program participants as co-researchers, increasing rigor of results by incorporating participants' first-person perspectives"
			]
		},
		{
			"company": "Penske Media Corporation",
			"position": "Principal Software Engineer",
			"startDate": "2018",
			"endDate": "2022",
			"summary": "",
			"highlights": [
				"Conducted applied research study with 15+ stakeholders across product, design, and engineering to assess how emerging web technologies align with business challenges; translated findings into framework and recommendations for C-suite, securing CEO buy-in for platform innovation initiative and developing proof-of-concept prototypes",
				"Initiated approach to a re-usable component system and platform architecture; increased productivity for re-platforming brand acquisitions by 60% and enabled engineering team to more rapidly address brand requests",
				"Developed change management approach including documentation, training, collaboration tools, and communication channels supporting adoption across 80-person product and engineering department; aligned objectives between engineering, design, product, and brand stakeholders"
			]
		},
		{
			"company": "Lara Schenck, LLC",
			"position": "Founder & Technical Consultant",
			"startDate": "2011",
			"endDate": "2018",
			"summary": "",
			"highlights": [
				"Built and managed independent consulting business, serviced 30+ clients including The Weather Channel, Barnes and Noble, web development agencies, startups, and small businesses",
				"Developed customized training plans and end-to-end product branding, prototypes, designs, and builds to meet business needs"
			]
		},
		{
			"company": "Pratt Institute",
			"position": "Adjunct Instructor - \"Prototyping in Code\"",
			"startDate": "2014",
			"endDate": "2016",
			"summary": "",
			"highlights": [
				"Founding instructor of UI/UX continuing education certificate program, developing two courses teaching programming fundamentals and technical communication to enable communication of ideas through prototyping",
				"Taught 12-15 non-technical working professionals per cohort from diverse backgrounds including sales, graphic design, and marketing"
			]
		},
		{
			"company": "Decoded",
			"position": "Executive Education Facilitator",
			"startDate": "2014",
			"endDate": "2016",
			"summary": "",
			"highlights": [
				"Facilitated 'Code in a Day' workshops for non-technical executives, improving their technical communication and understanding of modern development concepts",
				"Provided individualized support adapting curriculum to executives' specific business contexts and communication needs"
			]
		}
	],
	"volunteer": [
		{
			"company": "International",
			"position": "Conference Speaker",
			"website": "https://supremenetwork.org",
			"startDate": "2013",
			"endDate": "present",
			"highlights": [
				"Presented research at academic conferences (CSCW, SIGCSE, ICER, STS Symposium), communicating findings across disciplines",
				"Promoted novel and emerging development approaches with presentations delivered at 13 international industry conferences to audiences of 25-500+ attendees; recorded talks have 40k+ views"
			]
		},		
		{
			"company": "WordPress Core",
			"position": "Open Source Contributor",
			"website": "https://make.wordpress.org/core/tag/core-css/",
			"startDate": "2011",
			"endDate": "2022",
			"highlights": [
				"Contributed to WordPress Core open-source project, contributing code, facilitating and organizing team meetings, and presenting at conferences and meetups to support vital community growth"
			]
		},
		{
			"company": "National",
			"position": "Mentorship & Community Organizing",
			"website": "http://c4aa.org/",
			"startDate": "2011",
			"endDate": "Present",
			"highlights": [
				"Co-founded mentorship program pairing senior PhD students with junior PhD students in computing",
				"Founded and co-organized ongoing developer meetups and conferences providing vital community support for new developers"
			]
		}
	],
	"speaking": [
		"<em>Generative Art With FizzBuzz in CSS</em> (invited) at CodeDay – online, 2021",
		"<em>CSS Algorithms</em> at StrangeLoop – St. Louis, 2019",
		"<em>Is CSS a Programming Language?</em> at Abstractions – Pittsburgh, 2019",
		"<em>CSS Algorithms</em> at JS Conf US – San Diego, 2019",
		"<em>Writing CSS Algorithms</em> at CSS Camp – Barcelona, 2019",
		"<em>Algorithms of CSS</em> at CSS Day (invited) – Amsterdam, 2019",
		"<em>CSS is a Programming Language</em> at WordCamp Montclair (invited) – Montclair, NJ, 2019",
		"<em>Bridging the Gap Between Design & Development</em> at WordCamp US – Nashville, 2018",
		"<em>Understanding Today’s CSS with Algorithms</em> at SIGNAL (invited) – San Francisco, 2018",
		"<em>The Algorithms of CSS</em> at js.la – Los Angeles, 2018",
		"<em>The Algorithms of CSS</em> at CSSConf EU – Berlin, 2018",
		"<em>Let’s Build A Gutenberg Block Workshop</em> at WordCamp EU – Belgrade, 2018",
		"<em>Let’s Build A Gutenberg Block</em> at WordCamp San Diego – San Diego, 2018",
		"<em>The Five-figure WordPress Website</em> at Abstractions – Pittsburgh, 2016",
		"<em>Vetting and Choosing Themes</em> at WordCamp Pittsburgh – Pittsburgh, 2016",
		"<em>Why the Designer Failed FizzBuzz</em> at SassConf – Austin, 2015",
		"<em>Sassy WordPress</em> at WordCamp Montreal – Montreal, 2014",
		"<em>Freelancing, Real Talk</em> at WordCamp NYC – NYC, 2014"
	],
	"outreach": [
		"<b>Mentor</b>, Learn Teach Code – Los Angeles and online, 2017-2021",
		"<b>Co-Organizer</b>, Global Diversity CFP Day – Pittsburgh, 2019",
		"<b>Mentor</b>, Write Speak Code – Los Angeles, 2017-2019",
		"<b>Mentor</b>, Global Diversity CFP Day – Los Angeles, 2018",
		"<b>Co-Organizer</b>, WordCamp LA – Los Angeles, 2018",
		"<b>Founder and organizer</b>, CSS.la – Los Angeles, 2017-2019",
		"<b>Founder and organizer</b>, CodePen Meetup NYC – NYC, 2014-2016",
		"<b>Mentor, Presenter</b>, WordPress NYC Meetup – NYC, 2014-2016"
	],
	"awards": [
		{
			"position": "Pathbreakers Fellowship",
			"company": "Georgia Institute of Technology",
			"startDate": "2024"
		},
		{
			"position": "Graduate Research Fellowshop",
			"company": "National Science Foundation",
			"startDate": "2023"
		},
		{
			"position": "President's Fellowship",
			"company": "Georgia Institute of Technology",
			"startDate": "2022"
		}
	],
	"publications": {
		"peerReviewed": [
			{
				"cite": "<b>Lara Karki</b>, Kayla Uleah, Carl DiSalvo, Sierra Traynail Ross, Jadin Butler, Selamawit Husen, Emanuel Bryant, Dana Priest, Justin Booker, and Betsy DiSalvo. 2025.  'I get hives when I come on here': Persisting Through Platform-Delivered Microaggressions on LinkedIn. Proc. ACM Hum.-Comput. Interact. 9, 7, Article CSCW232 (November 2025), 36 pages. https://doi.org/10.1145/3757413"
			},
			{
				"cite": "<b>Lara Karki</b>, Dana Priest, James G. Dubose, Zajerria Godfrey, Annabel Rothschild, Ben Rydal Shapiro, and Betsy DiSalvo. 2025. A Window into DataWorks: Developing an Integrated Work-Training Curriculum for Novice Adults. In Proceedings of the 56th ACM Technical Symposium on Computer Science Education V. 1 (SIGCSETS 2025). Association for Computing Machinery, New York, NY, USA, 568–574. https://doi.org/10.1145/3641554.3701826"
			},
			{
				"cite": "Carl DiSalvo, Annabel Rothschild, <b>Lara L. Schenck</b>, Ben Rydal Shapiro, and Betsy DiSalvo. 2024. When Workers Want to Say No: A View into Critical Consciousness and Workplace Democracy in Data Work. Proc. ACM Hum.-Comput. Interact. 8, CSCW1, Article 156 (April 2024), 24 pages. https://doi.org/10.1145/3637433."
			}
		],
		"posters": [
			{
				"cite": "<b>Lara L. Schenck</b> and Betsy DiSalvo. 2023. \"From Data Work to Data Science: Getting Past the Gatekeepers.\" In ICER 2023. <a href=\"https://doi.org/10.1145/3568812.3603468\">DOI</a>.",
				"status": "Poster and Lightning Talk"
			},
			{
				"cite": "<b>Lara L. Schenck</b> and Betsy DiSalvo. \"Computational Work + Workplace Learning: A Pathway to Computing Careers for Adults.\" IPaT Industry Innovation Day and the GVU Research Showcase. 2023.",
				"status": "Poster"
			}
		]
	},
	"education": [
		{
			"position": "Ph.D. Human-Centered Computing",
			"company": "Georgia Institute of Technology",
			"summary": "<ul></li><li><b>Coursework:</b> Research Methods, Issues in Human-Centered Computing, Learning & Development, Social Studies of Technology, Prototyping Interactive Systems, Future of Work</li><li><b>Research:</b> Future of Work, Workforce Development, Human-Centered AI, Reskilling/Upskilling, AI Impact on Work</li></ul>",
			"startDate": "2022",
			"endDate": "Present"
		},
		{
			"position": "Bachelor of Fine Arts",
			"company": "School of the Museum of Fine Arts at Tufts University",
			"summary": "<ul><li><b>Coursework</b>: Animation, Painting, Printmaking and Bookmaking, Game Design; Self-Directed Internship in Open Source Web Development</ul>",
			"startDate": "2009",
			"endDate": "2011"
		}
	],
	"service": [
		{
			"position": "Conference Reviewing",
			"summary": "SIGCSE 2025, CSCW 2024, SIGCSE 2024, ACM Transactions in Computing Education (2023), DIS 2023"
		}
	],
	"skills": [
		"<strong>Human-Centered AI:</strong> AI/ML product design & development, human-AI collaboration, responsible AI, adoption, workforce impacts, work practices integration",
		"<strong>Development:</strong> Full-stack web engineering (PHP, Enterprise WordPress, JS, React, HTML/CSS), software architecture (design systems, MVC), software testing and CI/CD, data analysis (Python, pandas, matplotlib)",
		"<strong>Research:</strong> Applied research methods, ethnography, interviews and surveys, qualitative analysis, mixed-methods, impact evaluation, user research, Dovetail, MAXQDA, UI prototyping and testing",
		"<strong>Languages:</strong> English (Native), Nepali (Fluent), Spanish (Advanced Beginner)"
	],
	"hobbies": [
		"<a href=\"https://notlaura.com/monsters/\">Illustrating monsters</a>",
		"Learning Nepali language",
		"Running",
		"Biking",
		"Hiking"
	]
}